cfd/OpenFOAM/incompressible/simpleFoam/03_Half/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform $turbulentVisc;


boundaryField
{
    inlet
    {
        type        calculated;
        value       uniform 0;
    }

    outlet
    {
        type        calculated;
        value       uniform 0;
    }

    freestream
    {
        type        calculated;
        value       uniform 0;
    }

    model
    {
        type        nutkWallFunction;
        value       uniform 0;
    }
    
    sym
    {
        type        symmetryPlane;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
